app/views/books/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
						 	<%= link_to  book_favorites_path(@book.id),  method: :delete do %>
						 	🖤 <%= @book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]
---
						 	<%= link_to  book_favorites_path(@book.id),  method: :post do %>
						 	🤍 <%= @book.favorites.count %>

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]
---
					<!-- ここまで -->
					<td>コメント数：<%= @book.book_comments.count %></td>