app/controllers/book_comments_controller.rb

	def create
		@book = Book.find(params[:book_id])
		@book_comment = current_user.book_comments.new(book_comment_params)
		@book_comment.book_id = @book.id
		@book_comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "te"], ["user_id", 2], ["book_id", 1], ["created_at", "2020-09-06 08:31:31.454738"], ["updated_at", "2020-09-06 08:31:31.454738"]]

	def destroy
		@book = Book.find(params[:book_id])
		book_comment = current_user.book_comments.find_by(id: params[:id], book_id: @book.id)
		book_comment.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."user_id" = ? AND "book_comments"."id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["user_id", 2], ["id", 8], ["book_id", 2], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 8]]