app/controllers/books_controller.rb

SELECT "books".* FROM "books"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Harry potter"], ["body", "part4"], ["user_id", 6], ["created_at", "2020-08-25 18:30:57.669543"], ["updated_at", "2020-08-25 18:30:57.669543"]]
---
	def create
		@books = Book.all
		@user = User.find(current_user.id)
		@book = Book.new(book_params)
		@book.user_id = current_user.id
		if @book.save