app/controllers/users_controller.rb

  def show
  	@user = User.find(params[:id])
  	@books = @user.books.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 4]]

  def index
  	@users = User.all
  	@user = User.find(current_user.id)
---
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def update
  	@user = User.find(params[:id])
  	if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Tommy"], ["profile_image_id", "d3df7d7a0bdc5927bd9a5d6234a12966f04086cda9297be07058aa26e84f"], ["updated_at", "2020-08-25 10:18:47.401156"], ["id", 5]]